<?php

return
        array(
            101000000 =>
            array(
                'id' => '101000000',
                'name' => '手机通讯',
                'parent' => '1',
                'cats' =>
                array(
                    101010000 =>
                    array(
                        'id' => '101010000',
                        'name' => '手机',
                        'parent' => '101000000',
                    ),
                    101020000 =>
                    array(
                        'id' => '101020000',
                        'name' => '手机配件',
                        'parent' => '101000000',
                    ),
                    101030000 =>
                    array(
                        'id' => '101030000',
                        'name' => '通讯配件',
                        'parent' => '101000000',
                    ),
                    101040000 =>
                    array(
                        'id' => '101040000',
                        'name' => '其他通讯器材',
                        'parent' => '101000000',
                    ),
                ),
            ),
            102000000 =>
            array(
                'id' => '102000000',
                'name' => '图书音像',
                'parent' => '1',
                'cats' =>
                array(
                    102010000 =>
                    array(
                        'id' => '102010000',
                        'name' => '图书音像',
                        'parent' => '102000000',
                    ),
                ),
            ),
            103000000 =>
            array(
                'id' => '103000000',
                'name' => '电脑',
                'parent' => '1',
                'cats' =>
                array(
                    103010000 =>
                    array(
                        'id' => '103010000',
                        'name' => '笔记本',
                        'parent' => '103000000',
                    ),
                    103020000 =>
                    array(
                        'id' => '103020000',
                        'name' => '台式机',
                        'parent' => '103000000',
                    ),
                    103030000 =>
                    array(
                        'id' => '103030000',
                        'name' => '上网本',
                        'parent' => '103000000',
                    ),
                    103040000 =>
                    array(
                        'id' => '103040000',
                        'name' => '平板电脑',
                        'parent' => '103000000',
                    ),
                    103050000 =>
                    array(
                        'id' => '103050000',
                        'name' => '服务器',
                        'parent' => '103000000',
                    ),
                    103060000 =>
                    array(
                        'id' => '103060000',
                        'name' => '电脑DIY配件',
                        'parent' => '103000000',
                    ),
                    103070000 =>
                    array(
                        'id' => '103070000',
                        'name' => '外设产品',
                        'parent' => '103000000',
                    ),
                    103080000 =>
                    array(
                        'id' => '103080000',
                        'name' => '网络产品',
                        'parent' => '103000000',
                    ),
                ),
            ),
            105000000 =>
            array(
                'id' => '105000000',
                'name' => '电脑软件',
                'parent' => '1',
                'cats' =>
                array(
                    105010000 =>
                    array(
                        'id' => '105010000',
                        'name' => '电脑软件',
                        'parent' => '105000000',
                    ),
                ),
            ),
            106000000 =>
            array(
                'id' => '106000000',
                'name' => '数码相机',
                'parent' => '1',
                'cats' =>
                array(
                    106010000 =>
                    array(
                        'id' => '106010000',
                        'name' => '数码相机',
                        'parent' => '106000000',
                    ),
                    106020000 =>
                    array(
                        'id' => '106020000',
                        'name' => '数码摄像机',
                        'parent' => '106000000',
                    ),
                    106030000 =>
                    array(
                        'id' => '106030000',
                        'name' => '单反相机',
                        'parent' => '106000000',
                    ),
                    106040000 =>
                    array(
                        'id' => '106040000',
                        'name' => '单反镜头',
                        'parent' => '106000000',
                    ),
                    106050000 =>
                    array(
                        'id' => '106050000',
                        'name' => '数码配件',
                        'parent' => '106000000',
                    ),
                ),
            ),
            107000000 =>
            array(
                'id' => '107000000',
                'name' => '影音设备',
                'parent' => '1',
                'cats' =>
                array(
                    107010000 =>
                    array(
                        'id' => '107010000',
                        'name' => '影音设备',
                        'parent' => '107000000',
                    ),
                    107020000 =>
                    array(
                        'id' => '107020000',
                        'name' => '影音配件',
                        'parent' => '107000000',
                    ),
                ),
            ),
            108000000 =>
            array(
                'id' => '108000000',
                'name' => '办公用品',
                'parent' => '1',
                'cats' =>
                array(
                    108010000 =>
                    array(
                        'id' => '108010000',
                        'name' => '办公设备',
                        'parent' => '108000000',
                    ),
                    108020000 =>
                    array(
                        'id' => '108020000',
                        'name' => '办公耗材',
                        'parent' => '108000000',
                    ),
                    108030000 =>
                    array(
                        'id' => '108030000',
                        'name' => '日常办公用品',
                        'parent' => '108000000',
                    ),
                    108040000 =>
                    array(
                        'id' => '108040000',
                        'name' => '其他办公用品',
                        'parent' => '108000000',
                    ),
                ),
            ),
            109000000 =>
            array(
                'id' => '109000000',
                'name' => '大家电',
                'parent' => '1',
                'cats' =>
                array(
                    109010000 =>
                    array(
                        'id' => '109010000',
                        'name' => '平板电视/液晶电视',
                        'parent' => '109000000',
                    ),
                    109020000 =>
                    array(
                        'id' => '109020000',
                        'name' => '洗衣机',
                        'parent' => '109000000',
                    ),
                    109030000 =>
                    array(
                        'id' => '109030000',
                        'name' => '冰箱冰柜',
                        'parent' => '109000000',
                    ),
                    109040000 =>
                    array(
                        'id' => '109040000',
                        'name' => '空调',
                        'parent' => '109000000',
                    ),
                    109050000 =>
                    array(
                        'id' => '109050000',
                        'name' => '家庭影院/音箱',
                        'parent' => '109000000',
                    ),
                    109060000 =>
                    array(
                        'id' => '109060000',
                        'name' => '热水器',
                        'parent' => '109000000',
                    ),
                    109070000 =>
                    array(
                        'id' => '109070000',
                        'name' => '家电配件',
                        'parent' => '109000000',
                    ),
                    109080000 =>
                    array(
                        'id' => '109080000',
                        'name' => '其他大家电',
                        'parent' => '109000000',
                    ),
                ),
            ),
            110000000 =>
            array(
                'id' => '110000000',
                'name' => '生活小电器',
                'parent' => '1',
                'cats' =>
                array(
                    110010000 =>
                    array(
                        'id' => '110010000',
                        'name' => '生活小电器',
                        'parent' => '110000000',
                    ),
                ),
            ),
            111000000 =>
            array(
                'id' => '111000000',
                'name' => '厨房电器',
                'parent' => '1',
                'cats' =>
                array(
                    111010000 =>
                    array(
                        'id' => '111010000',
                        'name' => '厨房大电器',
                        'parent' => '111000000',
                    ),
                    111020000 =>
                    array(
                        'id' => '111020000',
                        'name' => '厨房小电器',
                        'parent' => '111000000',
                    ),
                ),
            ),
            112000000 =>
            array(
                'id' => '112000000',
                'name' => '保健护理电器',
                'parent' => '1',
                'cats' =>
                array(
                    112010000 =>
                    array(
                        'id' => '112010000',
                        'name' => '保健护理电器',
                        'parent' => '112000000',
                    ),
                ),
            ),
            113000000 =>
            array(
                'id' => '113000000',
                'name' => '女装',
                'parent' => '1',
                'cats' =>
                array(
                    113010000 =>
                    array(
                        'id' => '113010000',
                        'name' => '女士上衣',
                        'parent' => '113000000',
                    ),
                    113020000 =>
                    array(
                        'id' => '113020000',
                        'name' => '女士裙子',
                        'parent' => '113000000',
                    ),
                    113030000 =>
                    array(
                        'id' => '113030000',
                        'name' => '女士裤子',
                        'parent' => '113000000',
                    ),
                    113040000 =>
                    array(
                        'id' => '113040000',
                        'name' => '女士其他服装',
                        'parent' => '113000000',
                    ),
                    113050000 =>
                    array(
                        'id' => '113050000',
                        'name' => '女士中老年服装',
                        'parent' => '113000000',
                    ),
                    113060000 =>
                    array(
                        'id' => '113060000',
                        'name' => '女士职业套装',
                        'parent' => '113000000',
                    ),
                    113070000 =>
                    array(
                        'id' => '113070000',
                        'name' => '情侣装',
                        'parent' => '113000000',
                    ),
                ),
            ),
            114000000 =>
            array(
                'id' => '114000000',
                'name' => '男装',
                'parent' => '1',
                'cats' =>
                array(
                    114010000 =>
                    array(
                        'id' => '114010000',
                        'name' => '男士上衣',
                        'parent' => '114000000',
                    ),
                    114020000 =>
                    array(
                        'id' => '114020000',
                        'name' => '男士裤子',
                        'parent' => '114000000',
                    ),
                    114030000 =>
                    array(
                        'id' => '114030000',
                        'name' => '男士职业套装',
                        'parent' => '114000000',
                    ),
                    114040000 =>
                    array(
                        'id' => '114040000',
                        'name' => '男士中老年服装',
                        'parent' => '114000000',
                    ),
                    114050000 =>
                    array(
                        'id' => '114050000',
                        'name' => '男士其他服装',
                        'parent' => '114000000',
                    ),
                ),
            ),
            115000000 =>
            array(
                'id' => '115000000',
                'name' => '童装/童鞋/孕妇装',
                'parent' => '1',
                'cats' =>
                array(
                    115010000 =>
                    array(
                        'id' => '115010000',
                        'name' => '童装',
                        'parent' => '115000000',
                    ),
                    115020000 =>
                    array(
                        'id' => '115020000',
                        'name' => '童鞋/婴儿鞋',
                        'parent' => '115000000',
                    ),
                    115030000 =>
                    array(
                        'id' => '115030000',
                        'name' => '孕妇装/托腹裤',
                        'parent' => '115000000',
                    ),
                    115040000 =>
                    array(
                        'id' => '115040000',
                        'name' => '防辐射服',
                        'parent' => '115000000',
                    ),
                ),
            ),
            116000000 =>
            array(
                'id' => '116000000',
                'name' => '内衣',
                'parent' => '1',
                'cats' =>
                array(
                    116010000 =>
                    array(
                        'id' => '116010000',
                        'name' => '文胸',
                        'parent' => '116000000',
                    ),
                    116020000 =>
                    array(
                        'id' => '116020000',
                        'name' => '女士内衣',
                        'parent' => '116000000',
                    ),
                    116030000 =>
                    array(
                        'id' => '116030000',
                        'name' => '丝袜',
                        'parent' => '116000000',
                    ),
                    116040000 =>
                    array(
                        'id' => '116040000',
                        'name' => '男士内衣',
                        'parent' => '116000000',
                    ),
                    116050000 =>
                    array(
                        'id' => '116050000',
                        'name' => '保暖内衣',
                        'parent' => '116000000',
                    ),
                    116060000 =>
                    array(
                        'id' => '116060000',
                        'name' => '情侣内衣 ',
                        'parent' => '116000000',
                    ),
                ),
            ),
            117000000 =>
            array(
                'id' => '117000000',
                'name' => '女鞋',
                'parent' => '1',
                'cats' =>
                array(
                    117010000 =>
                    array(
                        'id' => '117010000',
                        'name' => '女士靴子',
                        'parent' => '117000000',
                    ),
                    117020000 =>
                    array(
                        'id' => '117020000',
                        'name' => '女士单鞋',
                        'parent' => '117000000',
                    ),
                    117030000 =>
                    array(
                        'id' => '117030000',
                        'name' => '女士凉鞋',
                        'parent' => '117000000',
                    ),
                    117040000 =>
                    array(
                        'id' => '117040000',
                        'name' => '女士拖鞋',
                        'parent' => '117000000',
                    ),
                    117050000 =>
                    array(
                        'id' => '117050000',
                        'name' => '雪地靴',
                        'parent' => '117000000',
                    ),
                    117060000 =>
                    array(
                        'id' => '117060000',
                        'name' => '女士休闲鞋',
                        'parent' => '117000000',
                    ),
                    117070000 =>
                    array(
                        'id' => '117070000',
                        'name' => '女士增高鞋',
                        'parent' => '117000000',
                    ),
                    117080000 =>
                    array(
                        'id' => '117080000',
                        'name' => '情侣鞋',
                        'parent' => '117000000',
                    ),
                ),
            ),
            118000000 =>
            array(
                'id' => '118000000',
                'name' => '男鞋',
                'parent' => '1',
                'cats' =>
                array(
                    118010000 =>
                    array(
                        'id' => '118010000',
                        'name' => '男士皮鞋',
                        'parent' => '118000000',
                    ),
                    118020000 =>
                    array(
                        'id' => '118020000',
                        'name' => '男士休闲鞋',
                        'parent' => '118000000',
                    ),
                    118030000 =>
                    array(
                        'id' => '118030000',
                        'name' => '男士靴子',
                        'parent' => '118000000',
                    ),
                    118040000 =>
                    array(
                        'id' => '118040000',
                        'name' => '男士棉鞋',
                        'parent' => '118000000',
                    ),
                    118050000 =>
                    array(
                        'id' => '118050000',
                        'name' => '男士增高鞋',
                        'parent' => '118000000',
                    ),
                    118060000 =>
                    array(
                        'id' => '118060000',
                        'name' => '男士凉鞋',
                        'parent' => '118000000',
                    ),
                    118070000 =>
                    array(
                        'id' => '118070000',
                        'name' => '男士拖鞋',
                        'parent' => '118000000',
                    ),
                    118080000 =>
                    array(
                        'id' => '118080000',
                        'name' => '男士布鞋',
                        'parent' => '118000000',
                    ),
                ),
            ),
            119000000 =>
            array(
                'id' => '119000000',
                'name' => '运动鞋',
                'parent' => '1',
                'cats' =>
                array(
                    119010000 =>
                    array(
                        'id' => '119010000',
                        'name' => '运动鞋',
                        'parent' => '119000000',
                    ),
                ),
            ),
            120000000 =>
            array(
                'id' => '120000000',
                'name' => '女包/男包/箱包',
                'parent' => '1',
                'cats' =>
                array(
                    120010000 =>
                    array(
                        'id' => '120010000',
                        'name' => '双肩包',
                        'parent' => '120000000',
                    ),
                    120020000 =>
                    array(
                        'id' => '120020000',
                        'name' => '钱包/皮夹/卡包',
                        'parent' => '120000000',
                    ),
                    120030000 =>
                    array(
                        'id' => '120030000',
                        'name' => '斜挎包',
                        'parent' => '120000000',
                    ),
                    120040000 =>
                    array(
                        'id' => '120040000',
                        'name' => '手提包/手包',
                        'parent' => '120000000',
                    ),
                    120050000 =>
                    array(
                        'id' => '120050000',
                        'name' => '笔记本电脑包',
                        'parent' => '120000000',
                    ),
                    120060000 =>
                    array(
                        'id' => '120060000',
                        'name' => '旅行箱',
                        'parent' => '120000000',
                    ),
                    120070000 =>
                    array(
                        'id' => '120070000',
                        'name' => '儿童包/书包',
                        'parent' => '120000000',
                    ),
                    120080000 =>
                    array(
                        'id' => '120080000',
                        'name' => '其他包',
                        'parent' => '120000000',
                    ),
                    120090000 =>
                    array(
                        'id' => '120090000',
                        'name' => '腰包',
                        'parent' => '120000000',
                    ),
                ),
            ),
            121000000 =>
            array(
                'id' => '121000000',
                'name' => '手表',
                'parent' => '1',
                'cats' =>
                array(
                    121010000 =>
                    array(
                        'id' => '121010000',
                        'name' => '手表',
                        'parent' => '121000000',
                    ),
                ),
            ),
            122000000 =>
            array(
                'id' => '122000000',
                'name' => '服装配饰',
                'parent' => '1',
                'cats' =>
                array(
                    122010000 =>
                    array(
                        'id' => '122010000',
                        'name' => '服装配饰',
                        'parent' => '122000000',
                    ),
                ),
            ),
            123000000 =>
            array(
                'id' => '123000000',
                'name' => '眼镜',
                'parent' => '1',
                'cats' =>
                array(
                    123010000 =>
                    array(
                        'id' => '123010000',
                        'name' => '眼镜',
                        'parent' => '123000000',
                    ),
                ),
            ),
            124000000 =>
            array(
                'id' => '124000000',
                'name' => '珠宝',
                'parent' => '1',
                'cats' =>
                array(
                    124010000 =>
                    array(
                        'id' => '124010000',
                        'name' => '珠宝',
                        'parent' => '124000000',
                    ),
                ),
            ),
            125000000 =>
            array(
                'id' => '125000000',
                'name' => '家居',
                'parent' => '1',
                'cats' =>
                array(
                    125010000 =>
                    array(
                        'id' => '125010000',
                        'name' => '床上用品',
                        'parent' => '125000000',
                    ),
                    125020000 =>
                    array(
                        'id' => '125020000',
                        'name' => '日用品',
                        'parent' => '125000000',
                    ),
                    125030000 =>
                    array(
                        'id' => '125030000',
                        'name' => '厨卫用品',
                        'parent' => '125000000',
                    ),
                    125040000 =>
                    array(
                        'id' => '125040000',
                        'name' => '家饰用品',
                        'parent' => '125000000',
                    ),
                ),
            ),
            126000000 =>
            array(
                'id' => '126000000',
                'name' => '母婴/玩具',
                'parent' => '1',
                'cats' =>
                array(
                    126010000 =>
                    array(
                        'id' => '126010000',
                        'name' => '婴幼儿奶粉',
                        'parent' => '126000000',
                    ),
                    126020000 =>
                    array(
                        'id' => '126020000',
                        'name' => '防尿用品',
                        'parent' => '126000000',
                    ),
                    126030000 =>
                    array(
                        'id' => '126030000',
                        'name' => '养护用品',
                        'parent' => '126000000',
                    ),
                    126040000 =>
                    array(
                        'id' => '126040000',
                        'name' => '婴儿洗护',
                        'parent' => '126000000',
                    ),
                    126050000 =>
                    array(
                        'id' => '126050000',
                        'name' => '出行用品',
                        'parent' => '126000000',
                    ),
                    126060000 =>
                    array(
                        'id' => '126060000',
                        'name' => '孕产妇用品',
                        'parent' => '126000000',
                    ),
                    126070000 =>
                    array(
                        'id' => '126070000',
                        'name' => '其他母婴用品',
                        'parent' => '126000000',
                    ),
                    126080000 =>
                    array(
                        'id' => '126080000',
                        'name' => '婴幼儿玩具',
                        'parent' => '126000000',
                    ),
                ),
            ),
            127000000 =>
            array(
                'id' => '127000000',
                'name' => '运动户外',
                'parent' => '1',
                'cats' =>
                array(
                    127010000 =>
                    array(
                        'id' => '127010000',
                        'name' => '运动服装',
                        'parent' => '127000000',
                    ),
                    127020000 =>
                    array(
                        'id' => '127020000',
                        'name' => '户外装备',
                        'parent' => '127000000',
                    ),
                    127030000 =>
                    array(
                        'id' => '127030000',
                        'name' => '运动器械',
                        'parent' => '127000000',
                    ),
                    127040000 =>
                    array(
                        'id' => '127040000',
                        'name' => '其他户外',
                        'parent' => '127000000',
                    ),
                ),
            ),
            128000000 =>
            array(
                'id' => '128000000',
                'name' => '成人用品',
                'parent' => '1',
                'cats' =>
                array(
                    128010000 =>
                    array(
                        'id' => '128010000',
                        'name' => '成人用品',
                        'parent' => '128000000',
                    ),
                ),
            ),
            129000000 =>
            array(
                'id' => '129000000',
                'name' => '鲜花礼品',
                'parent' => '1',
                'cats' =>
                array(
                    129010000 =>
                    array(
                        'id' => '129010000',
                        'name' => '鲜花',
                        'parent' => '129000000',
                    ),
                    129020000 =>
                    array(
                        'id' => '129020000',
                        'name' => '礼品',
                        'parent' => '129000000',
                    ),
                ),
            ),
            130000000 =>
            array(
                'id' => '130000000',
                'name' => '食品粮油',
                'parent' => '1',
                'cats' =>
                array(
                    110030000 =>
                    array(
                        'id' => '110030000',
                        'name' => '酒',
                        'parent' => '130000000',
                    ),
                    130010000 =>
                    array(
                        'id' => '130010000',
                        'name' => '休闲食品',
                        'parent' => '130000000',
                    ),
                    130040000 =>
                    array(
                        'id' => '130040000',
                        'name' => '茶叶',
                        'parent' => '130000000',
                    ),
                    130050000 =>
                    array(
                        'id' => '130050000',
                        'name' => '粮油',
                        'parent' => '130000000',
                    ),
                ),
            ),
            131000000 =>
            array(
                'id' => '131000000',
                'name' => '汽车用品',
                'parent' => '1',
                'cats' =>
                array(
                    131010000 =>
                    array(
                        'id' => '131010000',
                        'name' => '导航/通讯',
                        'parent' => '131000000',
                    ),
                    131020000 =>
                    array(
                        'id' => '131020000',
                        'name' => '车内饰品',
                        'parent' => '131000000',
                    ),
                    131030000 =>
                    array(
                        'id' => '131030000',
                        'name' => '养护用品',
                        'parent' => '131000000',
                    ),
                    131040000 =>
                    array(
                        'id' => '131040000',
                        'name' => '车内用品',
                        'parent' => '131000000',
                    ),
                    131050000 =>
                    array(
                        'id' => '131050000',
                        'name' => '其他汽车用品',
                        'parent' => '131000000',
                    ),
                ),
            ),
            132000000 =>
            array(
                'id' => '132000000',
                'name' => '医药保健',
                'parent' => '1',
                'cats' =>
                array(
                    132010000 =>
                    array(
                        'id' => '132010000',
                        'name' => '医药品',
                        'parent' => '132000000',
                    ),
                    132020000 =>
                    array(
                        'id' => '132020000',
                        'name' => '保健品',
                        'parent' => '132000000',
                    ),
                ),
            ),
            133000000 =>
            array(
                'id' => '133000000',
                'name' => '宠物用品',
                'parent' => '1',
                'cats' =>
                array(
                    133010000 =>
                    array(
                        'id' => '133010000',
                        'name' => '宠物用品',
                        'parent' => '133000000',
                    ),
                ),
            ),
            134000000 =>
            array(
                'id' => '134000000',
                'name' => '美容护理',
                'parent' => '1',
                'cats' =>
                array(
                    134010000 =>
                    array(
                        'id' => '134010000',
                        'name' => '面部护理',
                        'parent' => '134000000',
                    ),
                    134020000 =>
                    array(
                        'id' => '134020000',
                        'name' => '眼部护理',
                        'parent' => '134000000',
                    ),
                    134030000 =>
                    array(
                        'id' => '134030000',
                        'name' => '唇部护理',
                        'parent' => '134000000',
                    ),
                    134040000 =>
                    array(
                        'id' => '134040000',
                        'name' => '手部护理',
                        'parent' => '134000000',
                    ),
                    134050000 =>
                    array(
                        'id' => '134050000',
                        'name' => '足部护理',
                        'parent' => '134000000',
                    ),
                    134060000 =>
                    array(
                        'id' => '134060000',
                        'name' => '彩妆',
                        'parent' => '134000000',
                    ),
                    134070000 =>
                    array(
                        'id' => '134070000',
                        'name' => '美胸产品',
                        'parent' => '134000000',
                    ),
                    134080000 =>
                    array(
                        'id' => '134080000',
                        'name' => '香体粉/止汗露/香水/精油',
                        'parent' => '134000000',
                    ),
                    134090000 =>
                    array(
                        'id' => '134090000',
                        'name' => '美容工具',
                        'parent' => '134000000',
                    ),
                    134100000 =>
                    array(
                        'id' => '134100000',
                        'name' => '洗浴护体',
                        'parent' => '134000000',
                    ),
                    134110000 =>
                    array(
                        'id' => '134110000',
                        'name' => '其他美容',
                        'parent' => '134000000',
                    ),
                    134120000 =>
                    array(
                        'id' => '134120000',
                        'name' => '男士专区',
                        'parent' => '134000000',
                    ),
                ),
            ),
            135000000 =>
            array(
                'id' => '135000000',
                'name' => '其他服装',
                'parent' => '1',
                'cats' =>
                array(
                    135010000 =>
                    array(
                        'id' => '135010000',
                        'name' => '其他服装',
                        'parent' => '135000000',
                    ),
                ),
            ),
            136000000 =>
            array(
                'id' => '136000000',
                'name' => '其他鞋',
                'parent' => '1',
                'cats' =>
                array(
                ),
            ),
);